ErpTest/src/InformationRegisters/уатСоставТС/уатСоставТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатСоставТС</name>
  <comment>(уат)</comment>
  <resources>
    <name>ВСоставе</name>
    <comment>(Общ) ТС, в состав которого входит текущее</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>ТС</name>
    <comment>ТС или оборудование</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/уатСоставТС/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		Если ТекЗапись.ТС = ТекЗапись.ВСоставе Тогда
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("Нельзя указывать в составе ТС или оборудование само на себя!", Отказ,,СтатусСообщения.Внимание);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уатСоставТС.ТС,
		|	уатСоставТС.ВСоставе
		|ИЗ
		|	РегистрСведений.уатСоставТС КАК уатСоставТС
		|ГДЕ
		|	уатСоставТС.ТС = &ТС";
		
		Запрос.УстановитьПараметр("ТС", ТекЗапись.ТС);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("Невозможно произвести операцию. ТС """ + ТекЗапись.ТС
				+ """ уже в составе ТС """ + Выборка.ВСоставе + """!", Отказ,,СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
